# GetMatchOptions Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExternalResourceBrowserData..::..GetMatchOptions Method
ExternalResourceBrowserData Class See Also
---
Gets the match options used to filter external resources.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public ExternalResourceMatchOptions GetMatchOptions()
```

Visual Basic
---
```text
Public Function GetMatchOptions As ExternalResourceMatchOptions
```

Visual C++
---
```text
public:
ExternalResourceMatchOptions^ GetMatchOptions()
```

# ### Return Value
The external resource match options.
# See Also
ExternalResourceBrowserData Class
Autodesk.Revit.DB Namespace